Repository: Jianmarcel23/satuBC
Catalog: lib/l10n/app_*.arb
Languages: id

# languageSelection
source: Language
id: Bahasa

# appTitle
source: Customs and Excise Attendance System
id: Sistem Absensi Bea Cukai

source: Login
id: Masuk

# nip
source: Employee ID
id: NIP

source: Password
id: Kata Sandi

# rememberNip
source: Remember Employee ID
id: Ingat NIP

# loginWithNip
source: Login with Employee ID
id: Masuk dengan NIP

source: Forgot Password?
id: Lupa Kata Sandi?

# authenticationRequired
source: Face ID authentication is required to continue.
id: Autentikasi Face ID diperlukan untuk melanjutkan.

source: Try Face ID Again
id: Coba Face ID Lagi

source: Authenticating Face ID...
id: Melakukan autentikasi Face ID...

# faceIdSuccess
source: Face ID authentication successful. Please continue by entering your Employee ID and Password.
id: Autentikasi Face ID berhasil. Silakan lanjutkan dengan memasukkan NIP dan Kata Sandi.

# nipAndPasswordRequired
source: Employee ID and password are required.
id: NIP dan kata sandi harus diisi.

# invalidNipOrPassword
source: Invalid Employee ID or password. Please check and try again. (Attempt {attempt}/{maxAttempts})
id: NIP atau kata sandi tidak valid. Silakan periksa kembali dan coba lagi. (Percobaan {attempt}/{maxAttempts})

# loginError
source: An error occurred during login: {error}
id: Terjadi kesalahan saat masuk: {error}

# maxLoginAttemptsReached
source: Maximum login attempts reached. Please contact the administrator.
id: Batas maksimum percobaan masuk telah tercapai. Silakan hubungi administrator.

# locationNotAllowed
source: You are outside the allowed area. Please move to the designated location and try again.
id: Anda berada di luar area yang diizinkan. Silakan pindah ke lokasi yang telah ditentukan dan coba lagi.

# contactAdminForReset
source: Please contact the administrator to reset your password.
id: Silakan hubungi administrator untuk mereset kata sandi Anda.

source: Close
id: Tutup

# welcome
source: Welcome, {nip}!
id: Selamat datang, {nip}!

# employeeTitle
source: Customs and Excise Officer
id: Pegawai Bea Cukai

# inAllowedLocation
source: You are in an allowed location
id: Anda berada di lokasi yang diizinkan

# notInAllowedLocation
source: You are not in an allowed location
id: Anda tidak berada di lokasi yang diizinkan

source: Logout
id: Keluar

source: Loading...
id: Memuat...

source: Profile
id: Profil

source: Attendance History
id: Riwayat Kehadiran

# loginButton
source: Clock In
id: Masuk

# breakButton
source: Break
id: Istirahat

# logoutButton
source: Clock Out
id: Pulang

source: Scan QR Code
id: Pindai Kode QR

source: Timecard
id: Kartu Waktu

# confirmAttendance
source: Confirm {activity}
id: Konfirmasi {activity}

# confirmAttendanceMessage
source: Are you sure you want to mark {activity}?
id: Apakah Anda yakin ingin menandai {activity}?

source: Cancel
id: Batal

source: Confirm
id: Konfirmasi

# alreadyMarkedAttendance
source: You have already marked {activity} today.
id: Anda sudah menandai {activity} hari ini.

# attendanceMarked
source: {activity} successfully marked at {time}.
id: {activity} berhasil ditandai pada {time}.

# markAttendanceError
source: An error occurred while marking attendance.
id: Terjadi kesalahan saat menandai kehadiran.

# refreshDataError
source: An error occurred while refreshing data.
id: Terjadi kesalahan saat memperbarui data.

# fetchUserDataError
source: An error occurred while fetching user data.
id: Terjadi kesalahan saat mengambil data pengguna.

# loadAttendanceError
source: An error occurred while loading attendance data.
id: Terjadi kesalahan saat memuat data kehadiran.

# locationPermissionRequired
source: Location permission is required to use this app.
id: Izin lokasi diperlukan untuk menggunakan aplikasi ini.

# locationPermissionDeniedForever
source: Location permission has been permanently denied. Please enable it in your device settings.
id: Izin lokasi telah ditolak secara permanen. Silakan aktifkan di pengaturan perangkat Anda.

source: Already Marked
id: Sudah Ditandai
